In [1]:
import pandas as pd

In [4]:
DF1 = pd.DataFrame({'Nombre':['Jose','Max'],
                   'Carreras':['Economia','Arquitectura'],
                   'Edad':[22,27]}).set_index('Nombre')

In [5]:
DF2 = pd.DataFrame({'Nombre':['Ana','Lucia'],
                   'Carreras':['Medicina','Informatica'],
                   'Edad':[22,28]}).set_index('Nombre')

In [6]:
df = pd.concat([DF1,DF2])

In [7]:
DF1

            Carreras  Edad
Nombre
Jose        Economia    22
Max     Arquitectura    27

In [8]:
DF2

           Carreras  Edad
Nombre
Ana        Medicina    22
Lucia   Informatica    28

In [9]:
df

            Carreras  Edad
Nombre
Jose        Economia    22
Max     Arquitectura    27
Ana         Medicina    22
Lucia    Informatica    28